---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsLogical
source: html/e1f7a655-d055-fb68-7f68-5c0b5806b3e2.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsLogical Method

Gets storage value as IFCLogical when its PrimitiveType is logical.

## Syntax (C#)
```csharp
public IFCLogical AsLogical()
```

## Returns
The IFCLogical value.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not logical.